read_verilog toplevel.v

# Replace undefined (x) constants and undriven nets with defined 0 constants.
# This will prevent Yosys creating more than one GND net. 
# (although maybe it needs to have a pass that merges GND nets)
# If this isn't done, setting only some outputs to 0 and not others will result in two nets by the name of "GND_NET"
proc
setundef -zero -undriven o:*

synth_intel_alm -nobram -nolutram -top toplevel -nodsp
write_json toplevel.json